Revit 2024 API
IFCAnyHandle.SetAttribute Method (String, IList<Int32>)
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetAttribute(
	string name,
	IList<int> values
)
Visual Basic
Public Sub SetAttribute ( _
	name As String, _
	values As IList(Of Integer) _
)
Visual C++
public:
void SetAttribute(
	String^ name,
	IList<int>^ values
)
Parameters
name
Type: System.String
values
Type: System.Collections.Generic.IList<Int32>
See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace